"""
Як ми знаємо, ключ у словнику має бути унікальним, тоді як значення його ні. 
Реалізуйте функцію lookup_key для пошуку всіх ключів за значенням у словнику. Першим параметром у функцію ми передаємо словник, 
а другим — значення, що хочемо знайти. Таким чином, результат може бути як список ключів, так і порожній список, якщо ми нічого не знайдемо.
"""

def lookup_key(data, value):

    key_lst = []
    for key, val in data.items():
        if val == value:
            key_lst.append(key)
    return key_lst    


def main():

    grades = {"F": 1, "FX": 2, "E": 3, "D": 3, "C": 4, "B": 5, "A": 5, "Test": 2}
    value = 2
    print(lookup_key(grades, value))


if __name__ == "__main__":
    main()